name: "LeNet"
layer {
  name: "GO"
  type: "Data"
  top: "data"
  top: "label"
  data_param {
    source: "examples/GO/GO-train-leveldb"
    backend: LEVELDB
    batch_size: 100
  }
  transform_param {
    scale: 1
  }
  include: { phase: TRAIN }
}
layer {
  name: "GO"
  type: "Data"
  top: "data"
  top: "label"
  data_param {
    source: "examples/GO/GO-test-leveldb"
    backend: LEVELDB
    batch_size: 100
  }
  transform_param {
    scale: 1
  }
  include: { phase: TEST }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 64
    kernel_size: 5
    pad: 2
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

 
layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "conv1"
  top: "ip2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 361
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "ip2"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "ip2"
  bottom: "label"
  top: "loss"
}
